canhembed/xiaozhi-esp32/main/audio/audio_service.cc
                        // Now scan forward in the REMAINING data for the next ADTS sync word (0xFF 0xFx)
                        bool found_sync = false;
                        if (raw.len >= 2 && raw.buffer[0] == 0xFF && (raw.buffer[1] & 0xF0) == 0xF0) {
                            // Already at a sync word
                            found_sync = true;
                        } else {
                            for (size_t i = 0; i + 1 < raw.len; ++i) {
                                if (raw.buffer[i] == 0xFF && (raw.buffer[i + 1] & 0xF0) == 0xF0) {
                                    raw.buffer += i;
                                    raw.len -= i;
                                    found_sync = true;
                                    break;
                                }
                            }
                        }

                        if (!found_sync) {
                            // No sync found in the remaining chunk. 
                            // Save the entire remaining chunk (up to limit) since it might be the start of a sync word split across chunks.
                            if (raw.len > 0 && raw.len <= 32768) {
                                aac_residual_buffer_.assign(raw.buffer, raw.buffer + raw.len);
                            }
                            break;
                        }

                        if (full_pcm.size() >= 16384) {
                            auto flush_task = std::make_unique<AudioTask>();
                            flush_task->type = kAudioTaskTypeDecodeToPlaybackQueue;
                            flush_task->timestamp = task->timestamp;
                            flush_task->playback_id = task->playback_id;
                            flush_task->media_position_ms = task->media_position_ms;
                            flush_task->pcm = std::move(full_pcm);
                            
                            std::unique_lock<std::mutex> flush_lock(audio_queue_mutex_);
                            audio_queue_cv_.wait(flush_lock, [this]() {
                                return service_stopped_.load() || audio_playback_queue_.size() < MAX_PLAYBACK_TASKS_IN_QUEUE;
                            });
                            if (!service_stopped_.load() && generation == playback_generation_) {
                                audio_playback_queue_.push_back(std::move(flush_task));
                                const bool notify_drained = MarkPlaybackDrainedLocked();
                                audio_queue_cv_.notify_all();
                                flush_lock.unlock();
                                if (notify_drained && callbacks_.on_playback_drained) {
                                    callbacks_.on_playback_drained();
                                }
                            } else {
                                flush_lock.unlock();
                            }
                            full_pcm = std::vector<int16_t>();
                            full_pcm.reserve(16384);
                        }
                    }
                }

                if (decode_success && !full_pcm.empty()) {
                    task->pcm = std::move(full_pcm);
                    decoded = true;
                }
            } else if (packet->format == 1) { // 1 is MP3
                // Lazy-init MP3 decoder on first MP3 packet
                if (mp3_decoder_ == nullptr) {
                    ESP_LOGI(TAG, "Opening MP3 decoder for radio stream");
                    esp_mp3_dec_open(nullptr, 0, &mp3_decoder_);
                    if (mp3_decoder_ == nullptr) {
                        ESP_LOGE(TAG, "Failed to create MP3 decoder");
                    }
                }
                if (mp3_decoder_ != nullptr) {
                    // Prepend residual data if any
                    if (!mp3_residual_buffer_.empty()) {
                        packet->payload.insert(packet->payload.begin(), mp3_residual_buffer_.begin(), mp3_residual_buffer_.end());
                        mp3_residual_buffer_.clear();
                    }

                    esp_audio_dec_in_raw_t raw = {
                        .buffer = (uint8_t*)packet->payload.data(),
                        .len = (uint32_t)packet->payload.size(),
                        .consumed = 0,
                        .frame_recover = ESP_AUDIO_DEC_RECOVERY_NONE
                    };

                    std::vector<int16_t> full_pcm;
                    full_pcm.reserve(16384); // 32KB PCM chunks to prevent OOM
                    std::vector<int16_t> temp_pcm(4608); // MP3: 1152 samples * 2ch * 2 bytes
                    bool decode_success = false;

                    int frame_count = 0;
                    while (raw.len > 0) {
                        frame_count++;
                        if (frame_count % 3 == 0) {
                            vTaskDelay(pdMS_TO_TICKS(2)); // Yield to prevent starving PlaybackTask (stutter fix)
                        }
                        esp_audio_dec_out_frame_t out_frame = {
                            .buffer = (uint8_t*)temp_pcm.data(),
                            .len = (uint32_t)(temp_pcm.size() * sizeof(int16_t))
                        };
                        esp_audio_dec_info_t dec_info = {};
                        std::unique_lock<std::mutex> decoder_lock(decoder_mutex_);
                        auto ret = esp_mp3_dec_decode(mp3_decoder_, &raw, &out_frame, &dec_info);
                        decoder_lock.unlock();

                        if (ret == ESP_AUDIO_ERR_OK) {
                            size_t pcm_samples = out_frame.decoded_size / sizeof(int16_t);

                            // Create output resampler on first successful decode if needed
                            if (output_resampler_ == nullptr &&
                                dec_info.sample_rate > 0 &&
                                dec_info.sample_rate != (uint32_t)codec_->output_sample_rate()) {
                                ESP_LOGI(TAG, "MP3 stream: %uHz %uch, codec: %dHz - creating resampler",
                                         dec_info.sample_rate, dec_info.channel, codec_->output_sample_rate());
                                esp_ae_rate_cvt_cfg_t cvt_cfg = RATE_CVT_CFG(
                                    dec_info.sample_rate, codec_->output_sample_rate(), ESP_AUDIO_MONO);
                                esp_ae_rate_cvt_open(&cvt_cfg, &output_resampler_);
                            }

                            // Downmix stereo to mono if needed
                            if (dec_info.channel == 2) {
                                int16_t* src = (int16_t*)out_frame.buffer;
                                size_t mono_samples = pcm_samples / 2;
                                std::vector<int16_t> mono(mono_samples);
                                for (size_t i = 0; i < mono_samples; ++i) {
                                    mono[i] = (int32_t(src[i * 2]) + src[i * 2 + 1]) / 2;
                                }
                                if (dec_info.sample_rate != (uint32_t)codec_->output_sample_rate() && output_resampler_ != nullptr) {
                                    uint32_t target_size = 0;
                                    esp_ae_rate_cvt_get_max_out_sample_num(output_resampler_, mono_samples, &target_size);
                                    std::vector<int16_t> resampled(target_size);
                                    uint32_t actual_output = target_size;
                                    esp_ae_rate_cvt_process(output_resampler_, (esp_ae_sample_t)mono.data(), mono_samples,
                                                            (esp_ae_sample_t)resampled.data(), &actual_output);
                                    full_pcm.insert(full_pcm.end(), resampled.begin(), resampled.begin() + actual_output);
                                } else {
                                    full_pcm.insert(full_pcm.end(), mono.begin(), mono.end());
                                }
                            } else {
                                if (dec_info.sample_rate != (uint32_t)codec_->output_sample_rate() && output_resampler_ != nullptr) {
                                    uint32_t target_size = 0;
                                    esp_ae_rate_cvt_get_max_out_sample_num(output_resampler_, pcm_samples, &target_size);
                                    std::vector<int16_t> resampled(target_size);
                                    uint32_t actual_output = target_size;
                                    esp_ae_rate_cvt_process(output_resampler_, (esp_ae_sample_t)out_frame.buffer, pcm_samples,
                                                            (esp_ae_sample_t)resampled.data(), &actual_output);
                                    full_pcm.insert(full_pcm.end(), resampled.begin(), resampled.begin() + actual_output);
                                } else {
                                    int16_t* pcm_data = (int16_t*)out_frame.buffer;
                                    full_pcm.insert(full_pcm.end(), pcm_data, pcm_data + pcm_samples);
                                }
                            }
                            decode_success = true;

                            if (raw.consumed > 0 && raw.consumed <= raw.len) {
                                raw.buffer += raw.consumed;
                                raw.len -= raw.consumed;
                            } else {
                                break;
                            }
                        } else if (ret == ESP_AUDIO_ERR_DATA_LACK) {
                            if (raw.len <= 32768) {
                                mp3_residual_buffer_.assign(raw.buffer, raw.buffer + raw.len);
                            }
                            break;
                        } else {
                            // Decode error.
                            // Try to recover any partial PCM output first
                            if (out_frame.decoded_size > 0) {
                                size_t pcm_samples = out_frame.decoded_size / sizeof(int16_t);
                                if (dec_info.channel == 2) {
                                    int16_t* src = (int16_t*)out_frame.buffer;
                                    size_t mono_samples = pcm_samples / 2;
                                    std::vector<int16_t> mono(mono_samples);
                                    for (size_t i = 0; i < mono_samples; ++i) {
                                        mono[i] = (int32_t(src[i * 2]) + src[i * 2 + 1]) / 2;
                                    }
                                    if (dec_info.sample_rate > 0 && dec_info.sample_rate != (uint32_t)codec_->output_sample_rate() && output_resampler_ != nullptr) {
                                        uint32_t target_size = 0;
                                        esp_ae_rate_cvt_get_max_out_sample_num(output_resampler_, mono_samples, &target_size);
                                        std::vector<int16_t> resampled(target_size);
                                        uint32_t actual_output = target_size;
                                        esp_ae_rate_cvt_process(output_resampler_, (esp_ae_sample_t)mono.data(), mono_samples,
                                                                (esp_ae_sample_t)resampled.data(), &actual_output);
                                        full_pcm.insert(full_pcm.end(), resampled.begin(), resampled.begin() + actual_output);
                                    } else {
                                        full_pcm.insert(full_pcm.end(), mono.begin(), mono.end());
                                    }
                                } else {
                                    if (dec_info.sample_rate > 0 && dec_info.sample_rate != (uint32_t)codec_->output_sample_rate() && output_resampler_ != nullptr) {
                                        uint32_t target_size = 0;
                                        esp_ae_rate_cvt_get_max_out_sample_num(output_resampler_, pcm_samples, &target_size);
                                        std::vector<int16_t> resampled(target_size);
                                        uint32_t actual_output = target_size;
                                        esp_ae_rate_cvt_process(output_resampler_, (esp_ae_sample_t)out_frame.buffer, pcm_samples,
                                                                (esp_ae_sample_t)resampled.data(), &actual_output);
                                        full_pcm.insert(full_pcm.end(), resampled.begin(), resampled.begin() + actual_output);
                                    } else {
                                        int16_t* pcm_data = (int16_t*)out_frame.buffer;
                                        full_pcm.insert(full_pcm.end(), pcm_data, pcm_data + pcm_samples);
                                    }
                                }
                                decode_success = true;
                            }

                            // Always advance by what the decoder consumed, if any
                            if (raw.consumed > 0 && raw.consumed <= raw.len) {
                                raw.buffer += raw.consumed;
                                raw.len -= raw.consumed;
                            } else if (raw.len > 0) {
                                // Forcefully advance by 1 byte to prevent infinite loops
                                raw.buffer += 1;
                                raw.len -= 1;
                            }

