canhembed/xiaozhi-esp32/main/audio/audio_service.cc
                            // Scan for MP3 sync word (0xFF 0xEx or 0xFF 0xFx) in the REMAINING data
                            bool found_sync = false;
                            if (raw.len >= 2 && raw.buffer[0] == 0xFF && (raw.buffer[1] & 0xE0) == 0xE0) {
                                found_sync = true;
                            } else {
                                for (size_t i = 0; i + 1 < raw.len; ++i) {
                                    if (raw.buffer[i] == 0xFF && (raw.buffer[i + 1] & 0xE0) == 0xE0) {
                                        raw.buffer += i;
                                        raw.len -= i;
                                        found_sync = true;
                                        break;
                                    }
                                }
                            }

                            if (!found_sync) {
                                if (raw.len > 0 && raw.len <= 32768) {
                                    mp3_residual_buffer_.assign(raw.buffer, raw.buffer + raw.len);
                                }
                                break;
                            }
                        }

                        if (full_pcm.size() >= 16384) {
                            auto flush_task = std::make_unique<AudioTask>();
                            flush_task->type = kAudioTaskTypeDecodeToPlaybackQueue;
                            flush_task->timestamp = task->timestamp;
                            flush_task->playback_id = task->playback_id;
                            flush_task->media_position_ms = task->media_position_ms;
                            flush_task->pcm = std::move(full_pcm);
                            
                            std::unique_lock<std::mutex> flush_lock(audio_queue_mutex_);
                            audio_queue_cv_.wait(flush_lock, [this]() {
                                return service_stopped_.load() || audio_playback_queue_.size() < MAX_PLAYBACK_TASKS_IN_QUEUE;
                            });
                            if (!service_stopped_.load() && generation == playback_generation_) {
                                audio_playback_queue_.push_back(std::move(flush_task));
                                const bool notify_drained = MarkPlaybackDrainedLocked();
                                audio_queue_cv_.notify_all();
                                flush_lock.unlock();
                                if (notify_drained && callbacks_.on_playback_drained) {
                                    callbacks_.on_playback_drained();
                                }
                            } else {
                                flush_lock.unlock();
                            }
                            full_pcm = std::vector<int16_t>();
                            full_pcm.reserve(16384);
                        }
                    }

                    if (decode_success && !full_pcm.empty()) {
                        task->pcm = std::move(full_pcm);
                        decoded = true;
                    }
                }
            } else {
                ESP_LOGE(TAG, "Audio decoder is not configured or unsupported format: %d", packet->format);
            }

            lock.lock();
            if (decoded && generation == playback_generation_ && !service_stopped_.load()) {
                audio_playback_queue_.push_back(std::move(task));
            }
            decode_in_flight_ = false;
            debug_statistics_.decode_count++;
            const bool notify_drained = MarkPlaybackDrainedLocked();
            audio_queue_cv_.notify_all();
            lock.unlock();
            if (notify_drained && callbacks_.on_playback_drained) {
                callbacks_.on_playback_drained();
            }
            lock.lock();
        }
        /* Encode the audio to send queue */
        if (!audio_encode_queue_.empty()) {
            auto task = std::move(audio_encode_queue_.front());
            audio_encode_queue_.pop_front();
            audio_queue_cv_.notify_all();
            lock.unlock();

            auto packet = std::make_unique<AudioStreamPacket>();
            packet->frame_duration = OPUS_FRAME_DURATION_MS;
            packet->sample_rate = 16000;
            packet->timestamp = task->timestamp;

            if (opus_encoder_ != nullptr && task->pcm.size() == encoder_frame_size_) {
                std::vector<uint8_t> buf(encoder_outbuf_size_);
                esp_audio_enc_in_frame_t in = {
                    .buffer = (uint8_t *)(task->pcm.data()),
                    .len = (uint32_t)(encoder_frame_size_ * sizeof(int16_t)),
                };
                esp_audio_enc_out_frame_t out = {
                    .buffer = buf.data(),
                    .len = (uint32_t)encoder_outbuf_size_,
                    .encoded_bytes = 0,
                };
                auto ret = esp_opus_enc_process(opus_encoder_, &in, &out);
                if (ret == ESP_AUDIO_ERR_OK) {
                    packet->payload.assign(buf.data(), buf.data() + out.encoded_bytes);

                    if (task->type == kAudioTaskTypeEncodeToSendQueue) {
                        {
                            std::lock_guard<std::mutex> lock2(audio_queue_mutex_);
                            /* Never let a full send queue stall encoding: stale realtime
                             * audio is useless to the server, so drop the oldest packet. */
                            if (audio_send_queue_.size() >= MAX_SEND_PACKETS_IN_QUEUE) {
                                audio_send_queue_.pop_front();
                            }
                            audio_send_queue_.push_back(std::move(packet));
                        }
                        if (callbacks_.on_send_queue_available) {
                            callbacks_.on_send_queue_available();
                        }
                    } else if (task->type == kAudioTaskTypeEncodeToTestingQueue) {
                        std::lock_guard<std::mutex> lock2(audio_queue_mutex_);
                        audio_testing_queue_.push_back(std::move(packet));
                    }
                    debug_statistics_.encode_count++;
                } else {
                    ESP_LOGE(TAG, "Failed to encode audio, error code: %d", ret);
                }
            } else {
                ESP_LOGE(TAG, "Failed to encode audio: encoder not configured or invalid frame size (got %u, expected %u)",
                         task->pcm.size(), encoder_frame_size_);
            }
            lock.lock();
        }
    }

    ESP_LOGW(TAG, "Opus codec task stopped");
}

void AudioService::SetDecodeSampleRate(int sample_rate, int frame_duration) {
    if (decoder_sample_rate_ == sample_rate && decoder_duration_ms_ == frame_duration) {
        return;
    }
    std::unique_lock<std::mutex> decoder_lock(decoder_mutex_);
    if (opus_decoder_ != nullptr) {
        esp_opus_dec_close(opus_decoder_);
        opus_decoder_ = nullptr;
    }
    decoder_lock.unlock();
    esp_opus_dec_cfg_t opus_dec_cfg = OPUS_DEC_CFG(sample_rate, frame_duration);
    auto ret = esp_opus_dec_open(&opus_dec_cfg, sizeof(esp_opus_dec_cfg_t), &opus_decoder_);
    if (opus_decoder_ == nullptr) {
        ESP_LOGE(TAG, "Failed to create audio decoder, error code: %d", ret);
        return;
    }
    decoder_sample_rate_ = sample_rate;
    decoder_duration_ms_ = frame_duration;
    decoder_frame_size_ = decoder_sample_rate_ / 1000 * frame_duration;

